#### EDA

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('../data/sales-data.csv')

In [3]:
df.head(5)

         date  store  item  sales
0  2013-01-01      1     1     13
1  2013-01-02      1     1     11
2  2013-01-03      1     1     14
3  2013-01-04      1     1     13
4  2013-01-05      1     1     10

In [4]:
unique = df['item'].unique()

In [5]:
print(unique.size)
print(unique)

50
[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24
 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48
 49 50]

In [6]:
df['item'].value_counts()

item
1     18260
38    18260
28    18260
29    18260
30    18260
31    18260
32    18260
33    18260
34    18260
35    18260
36    18260
37    18260
39    18260
2     18260
40    18260
41    18260
42    18260
43    18260
44    18260
45    18260
46    18260
47    18260
48    18260
49    18260
27    18260
26    18260
25    18260
24    18260
3     18260
4     18260
5     18260
6     18260
7     18260
8     18260
9     18260
10    18260
11    18260
12    18260
13    18260
14    18260
15    18260
16    18260
17    18260
18    18260
19    18260
20    18260
21    18260
22    18260
23    18260
50    18260
Name: count, dtype: int64

In [7]:
df['store'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10], dtype=int64)

In [8]:
df.columns

Index(['date', 'store', 'item', 'sales'], dtype='object')

In [9]:
df.sample()

              date  store  item  sales
349648  2015-06-02      2    20     63

In [10]:
# df = df.sort_values(by=['store','item','date'])

In [11]:
df.isnull().sum()

date     0
store    0
item     0
sales    0
dtype: int64

In [12]:
df.duplicated().sum()

0

In [13]:
df.describe()

               store           item          sales
count  913000.000000  913000.000000  913000.000000
mean        5.500000      25.500000      52.250287
std         2.872283      14.430878      28.801144
min         1.000000       1.000000       0.000000
25%         3.000000      13.000000      30.000000
50%         5.500000      25.500000      47.000000
75%         8.000000      38.000000      70.000000
max        10.000000      50.000000     231.000000

In [14]:
df.head()

         date  store  item  sales
0  2013-01-01      1     1     13
1  2013-01-02      1     1     11
2  2013-01-03      1     1     14
3  2013-01-04      1     1     13
4  2013-01-05      1     1     10

In [15]:
df = df.sort_values(by=['date','store','item'])

In [16]:
df.head()

             date  store  item  sales
0      2013-01-01      1     1     13
18260  2013-01-01      1     2     33
36520  2013-01-01      1     3     15
54780  2013-01-01      1     4     10
73040  2013-01-01      1     5     11

In [17]:
df['date'].dtype

dtype('O')

In [18]:
df['date'] = pd.to_datetime(df['date'])

In [19]:
df['date'].dtype

dtype('<M8[ns]')

In [20]:
df.head()

            date  store  item  sales
0     2013-01-01      1     1     13
18260 2013-01-01      1     2     33
36520 2013-01-01      1     3     15
54780 2013-01-01      1     4     10
73040 2013-01-01      1     5     11

In [21]:
df['day'] = df['date'].dt.day

In [22]:
df['momth'] = df['date'].dt.month

In [23]:
df['dayofweek'] = df['date'].dt.dayofweek

In [24]:
df['is_weekend'] = df['dayofweek'].isin([5,6]).astype(int)

In [25]:
df.head()

            date  store  item  sales  day  momth  dayofweek  is_weekend
0     2013-01-01      1     1     13    1      1          1           0
18260 2013-01-01      1     2     33    1      1          1           0
36520 2013-01-01      1     3     15    1      1          1           0
54780 2013-01-01      1     4     10    1      1          1           0
73040 2013-01-01      1     5     11    1      1          1           0

In [26]:
df = df.rename(columns={'momth' : 'month'})

In [28]:
df.sample(5)

             date  store  item  sales  day  month  dayofweek  is_weekend
876506 2013-01-27      1    49      9   27      1          6           1
114426 2016-04-29      3     7     97   29      4          4           0
70317  2015-07-19      9     4     44   19      7          6           1
340487 2015-05-02      7    19     25    2      5          5           1
39689  2016-09-05      2     3     28    5      9          0           0

In [29]:
df.isnull().sum()

date          0
store         0
item          0
sales         0
day           0
month         0
dayofweek     0
is_weekend    0
dtype: int64

In [31]:
df.to_csv("../data/clean-data.csv",index = False)